src/cf/InformationRegisters/СообщенияPushУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СообщенияPushУведомлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУведомления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектУведомления</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СообщенияPushУведомлений/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

//Процедура - ДобавитьЗапись - добавить запись в РС
//
// Параметры:
//  ПолучательУведомления - СправочникСсылка.Пользователи - Ссылка на пользователя для которого формируется сообщение
//  					  -	СправочникСсылка.Сотрудники - Ссылка на сотрудника, пользователю которого формируется сообщение
//  ОбъектУведомления	  - ОпределяемыйТип - Ссылка на объект уведомления
//  Дата		 		  - Дата - Планируемая дата отправки уведомления
//  Сообщение	 		  - Строка - Текст сообщения
//
Процедура ДобавитьЗапись(ПолучательУведомления,
	ОбъектУведомления,
	Дата,
	Сообщение) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолучательУведомления) Тогда 
		Возврат;
	КонецЕсли;
	
	ЕстьОбъектУведомления = ЗначениеЗаполнено(ОбъектУведомления);
	Запись = СоздатьМенеджерЗаписи();

	Если ТипЗнч(ПолучательУведомления) = Тип("СправочникСсылка.Сотрудники") Тогда
		Запись.Пользователь = Сотрудники.ПользовательСотрудника(ПолучательУведомления);
	Иначе
		Запись.Пользователь = ПолучательУведомления;
	КонецЕсли;
	
	ДатаПоследнейОтправкиPushУведомлений = Константы.ДатаПоследнейОтправкиPushУведомлений.Получить();
	
	Если Дата <= ДатаПоследнейОтправкиPushУведомлений Тогда
		Дата = ДатаПоследнейОтправкиPushУведомлений + 1;
	КонецЕсли;
	
	Запись.ДатаОтправки = Дата;
	
	Если ЕстьОбъектУведомления Тогда
		Запись.ОбъектУведомления = ОбъектУведомления;
	КонецЕсли;

	Запись.ИдентификаторСообщения = ?(ЕстьОбъектУведомления,
		Строка(ОбъектУведомления.УникальныйИдентификатор()),
		Строка(Новый УникальныйИдентификатор()));
	
	Запись.Сообщение = Сообщение;

	Запись.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
